# Taps
tap "mongodb/brew"
tap "netbirdio/tap"
tap "nikitabobko/tap"
tap "skyhook-io/tap"

# ============================================================================
# CLI Tools
# ============================================================================

# Git
brew "git"                                   # Distributed version control
brew "git-extras"                            # Extra git commands (git-info, git-effort, etc.)
brew "git-delta"                             # Better git diff viewer
brew "gh"                                    # GitHub CLI
brew "gitui"                                 # Terminal UI for git

# Shell tools
brew "atuin"                                 # Magical shell history
brew "direnv"                                # Directory-based env vars
brew "fzf"                                   # Fuzzy finder
brew "ripgrep"                               # Fast grep alternative
brew "bat"                                   # Better cat with syntax highlighting
brew "tree"                                  # Directory tree view
brew "htop"                                  # Interactive process viewer
brew "btop"                                  # Modern resource monitor
brew "jq"                                    # JSON processor
brew "yq"                                    # YAML processor

# Editors
brew "neovim"                                # Modern vim
brew "helix"                                 # Post-modern editor

# Security
brew "gnupg"                                 # GPG encryption
brew "pinentry-mac"                          # GPG pinentry for macOS

# Network
brew "wget"                                  # File download tool
brew "croc"                                  # Secure file transfer
brew "netbirdio/tap/netbird"                 # Peer-to-peer VPN
brew "wireshark"                             # Network protocol analyzer (CLI)

# Kubernetes
brew "k9s"                                   # Kubernetes TUI
brew "kubectx"                               # Switch k8s contexts/namespaces
brew "minikube"                              # Local Kubernetes
brew "skaffold"                              # K8s dev workflow
brew "skyhook-io/tap/radar"                  # K8s topology & Helm management

# Databases
brew "libpq"                                 # PostgreSQL client libs
brew "mongosh"                               # MongoDB shell
brew "mongodb/brew/mongodb-database-tools"   # MongoDB tools (mongodump, etc.)

# Cloud
brew "awscli"                                # AWS CLI

# Languages & Runtimes
brew "python@3.12"                           # Python 3.12
brew "ruby"                                  # Ruby

# Media
brew "ffmpeg"                                # Video/audio processing
brew "graphviz"                              # Graph visualization
brew "imagemagick"                           # Image manipulation

# AI
brew "opencode"                              # AI coding agent for terminal

# ============================================================================
# GUI Applications
# ============================================================================

# Fonts
cask "font-iosevka"                          # Monospace font for coding
cask "font-jetbrains-mono"                   # JetBrains monospace font

# Terminals & Editors
cask "ghostty"                               # GPU-accelerated terminal
cask "visual-studio-code"                    # Code editor
cask "zed"                                   # Fast collaborative editor

# DevOps
cask "orbstack"                              # Docker/Linux VM (fast alternative)
cask "beekeeper-studio"                      # SQL database GUI
cask "mongodb-compass"                       # MongoDB GUI

# AI
cask "claude"                                # Claude AI assistant
cask "ollama-app"                            # Run local LLMs

# Productivity
cask "1password"                             # Password manager
cask "1password-cli"                         # 1Password CLI
cask "rectangle"                             # Window management
cask "maccy"                                 # Clipboard manager
cask "caffeine"                              # Prevent sleep
cask "linear-linear"                         # Project management
cask "notion"                                # Notes & docs

# Communication
cask "telegram"                              # Messaging
cask "discord"                               # Voice/text chat
cask "slack"                                 # Team communication
cask "whatsapp"                              # Messaging
cask "microsoft-teams"                       # Microsoft Teams

# Browsers
cask "brave-browser"                         # Privacy-focused browser
cask "google-chrome@canary"                  # Chrome canary

# Cloud
cask "gcloud-cli"                            # Google Cloud CLI
cask "google-cloud-sdk"                      # Google Cloud SDK

# Utilities
cask "netnewswire"                           # RSS reader
cask "folo"                                  # RSS reader
cask "cap"                                   # Screen recording
cask "utm"                                   # Virtual machines
cask "tunnelblick"                           # OpenVPN client
cask "wireshark-app"                         # Network analyzer GUI
cask "rar"                                   # Archive utility
cask "microsoft-auto-update"                 # Microsoft auto-updater
